results/consumer-slice/consumer-security-slice-plaintext-broker5/consumer-security-slice-plaintext-b5-rf3-isr3-msg1024-tps1000-batch16384-acksall-prod1-cons1-complz4-trial3/producer-seed.log
4997 records sent, 998.8 records/sec (0.98 MB/sec), 15.9 ms avg latency, 609.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.98 MB/sec), 5.7 ms avg latency, 25.0 ms max latency.
5005 records sent, 1000.6 records/sec (0.98 MB/sec), 5.6 ms avg latency, 19.0 ms max latency.
5002 records sent, 1000.2 records/sec (0.98 MB/sec), 5.8 ms avg latency, 31.0 ms max latency.
5002 records sent, 1000.0 records/sec (0.98 MB/sec), 5.5 ms avg latency, 40.0 ms max latency.
5004 records sent, 1000.2 records/sec (0.98 MB/sec), 5.5 ms avg latency, 22.0 ms max latency.
5002 records sent, 1000.0 records/sec (0.98 MB/sec), 5.6 ms avg latency, 25.0 ms max latency.
5007 records sent, 1000.8 records/sec (0.98 MB/sec), 5.6 ms avg latency, 32.0 ms max latency.
5008 records sent, 1000.4 records/sec (0.98 MB/sec), 5.7 ms avg latency, 45.0 ms max latency.
5003 records sent, 1000.0 records/sec (0.98 MB/sec), 5.4 ms avg latency, 27.0 ms max latency.
5002 records sent, 1000.4 records/sec (0.98 MB/sec), 5.5 ms avg latency, 30.0 ms max latency.
5007 records sent, 1000.4 records/sec (0.98 MB/sec), 5.5 ms avg latency, 26.0 ms max latency.
5005 records sent, 1000.0 records/sec (0.98 MB/sec), 5.6 ms avg latency, 52.0 ms max latency.
5004 records sent, 1000.4 records/sec (0.98 MB/sec), 5.8 ms avg latency, 46.0 ms max latency.
4993 records sent, 998.4 records/sec (0.98 MB/sec), 5.4 ms avg latency, 22.0 ms max latency.
5010 records sent, 1001.0 records/sec (0.98 MB/sec), 6.6 ms avg latency, 56.0 ms max latency.
5010 records sent, 1001.0 records/sec (0.98 MB/sec), 5.6 ms avg latency, 18.0 ms max latency.
5006 records sent, 1000.2 records/sec (0.98 MB/sec), 5.7 ms avg latency, 33.0 ms max latency.
5000 records sent, 1000.0 records/sec (0.98 MB/sec), 5.6 ms avg latency, 20.0 ms max latency.
100000 records sent, 999.480270 records/sec (0.98 MB/sec), 6.17 ms avg latency, 609.00 ms max latency, 5 ms 50th, 9 ms 95th, 20 ms 99th, 114 ms 99.9th.